Дошкольное_учреждение83/src/Documents/удуОприходованиеТМЦ/удуОприходованиеТМЦ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>удуОприходованиеТМЦ</name>
  <registerRecords>AccumulationRegister.удуТМЦ_НаСкладах</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.удуУчреждения</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.удуСклады</types>
    </type>
  </attributes>
  <attributes>
    <name>СкладыВТабличнойЧасти</name>
    <comment>Указывать склады в таб. части</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОперации</name>
    <type>
      <types>EnumRef.удуВидыОперацийПриходТМЦ</types>
    </type>
  </attributes>
  <attributes>
    <name>ПокпкаЧерезПодотчетноеЛицо</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЦенаВключаетНДС</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КВД</name>
    <type>
      <types>EnumRef.удуКВД</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидПервичногоДокумента</name>
    <type>
      <types>CatalogRef.удуВидыПервичныхДокументов</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПервичногоДокумента</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерПервичногоДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>40</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Корреспонденты</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ТМЦ</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.удуНоменклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ИнвентарныйНомер</name>
      <type>
        <types>CatalogRef.удуИнвентарныеНомера</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Склад</name>
      <type>
        <types>CatalogRef.удуСклады</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <type>
        <types>EnumRef.СтавкиНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>УчетныеЕдиницы</name>
    <attributes>
      <name>УчетнаяЕдиница</name>
      <type>
        <types>CatalogRef.удуУчетныеЕдиницы</types>
      </type>
    </attributes>
    <attributes>
      <name>ИнвентарныйНомер</name>
      <type>
        <types>CatalogRef.удуИнвентарныеНомера</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Склад</name>
      <type>
        <types>CatalogRef.удуСклады</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <type>
        <types>EnumRef.СтавкиНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Дошкольное_учреждение83/src/Enums/удуВидыОперацийПриходТМЦ/удуВидыОперацийПриходТМЦ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>удуВидыОперацийПриходТМЦ</name>
  <enumValues>
    <name>ПокупкаМатериалов</name>
  </enumValues>
  <enumValues>
    <name>ПоступлениеМатериаловПрочее</name>
  </enumValues>
  <enumValues>
    <name>ПокупкаПродуктовПитания</name>
  </enumValues>
  <enumValues>
    <name>ПокупкаМетодическихМатериалов</name>
  </enumValues>
  <enumValues>
    <name>ПокупкаОС</name>
  </enumValues>
</mdclass:Enum>

Дошкольное_учреждение83/src/Enums/удуВидыНоменклатуры/удуВидыНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>удуВидыНоменклатуры</name>
  <enumValues>
    <name>Материал</name>
  </enumValues>
  <enumValues>
    <name>ПродуктПитания</name>
  </enumValues>
  <enumValues>
    <name>ОС</name>
  </enumValues>
</mdclass:Enum>

Дошкольное_учреждение83/src/Documents/удуОприходованиеТМЦ/Forms/ФормаДокумента/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ


// Анализирует состав ТЧ ТМЦ, и определяет, нужно ли очищать ее при смене вида операции.
// Параметры:
// ВидОперации - Вид операции документа
//
&НаСервере
Функция ОпределитьНеобходимостьОчисткиТЧ_ТМЦ(ВидОперации)
	
    // Проверять нечего:	
	Если Объект.ТМЦ.Количество() = 0 Тогда
		Возврат(Ложь)
	КонецЕсли;
	
	// В соответствии с видом операции, в тч "ТМЦ" должна быть номенклатура одного типа.
	// Поэтому достаточно определить вид номенклатуры первой позиции:
	ВидНом = Объект.ТМЦ[0].Номенклатура.ВидНоменклатуры;
	
	Рез = Истина;
	
	Если ((ВидОперации = Перечисления.удуВидыОперацийПриходТМЦ.ПокупкаМатериалов) или
		 (ВидОперации = Перечисления.удуВидыОперацийПриходТМЦ.ПоступлениеМатериаловПрочее)) 
	   и (ВидНом = Перечисления.удуВидыНоменклатуры.Материал) Тогда
	   Рез = Ложь;
	   
   	ИначеЕсли (ВидОперации = Перечисления.удуВидыОперацийПриходТМЦ.ПокупкаОС)
	        и (ВидНом = Перечисления.удуВидыНоменклатуры.ОС) Тогда
       Рез = Ложь;
		
	ИначеЕсли (ВидОперации = Перечисления.удуВидыОперацийПриходТМЦ.ПокупкаПродуктовПитания)
	        и (ВидНом = Перечисления.удуВидыНоменклатуры.ПродуктПитания) Тогда
       Рез = Ложь; 
		
	КонецЕсли;
	
	Возврат (Рез);
	
КонецФункции	


// В зависимости от вида операции, определяет допустимый вид номенклатуры.
// Параметры:
// ВидОперации - Вид операции документа
//
&НаСервере
Функция ОпределитьДоступныеВидНоменклатуры(ВидОперации)

	Рез = Перечисления.удуВидыНоменклатуры.Материал;
	
	Если ВидОперации = Перечисления.удуВидыОперацийПриходТМЦ.ПокупкаОС Тогда
		Рез = Перечисления.удуВидыНоменклатуры.ОС;
	ИначеЕсли  ВидОперации = Перечисления.удуВидыОперацийПриходТМЦ.ПокупкаПродуктовПитания Тогда 
		Рез = Перечисления.удуВидыНоменклатуры.ПродуктПитания;	
	КонецЕсли;
	
	Возврат (Рез);
	
КонецФункции	


// Получает ставку НДС по-умолчанию для указанной номенклатуры
// Параметры:
// Номенклатура - Номенклатура, ставку НДС которой необходимо получить
//
&НаСервере
Функция ПолучитьСтавкуНДС(Номенклатура)
	
	Возврат(Номенклатура.СтавкаНДС);
	
КонецФункции

// Управляет видимостью элементов на форме
//
//
&НаКлиенте
Процедура УправлениеВидимостью()
	
	Элементы.Склад.Видимость    = Не Объект.СкладыВТабличнойЧасти;
	Элементы.ТМЦСклад.Видимость = Объект.СкладыВТабличнойЧасти;	
	Элементы.УчетныеЕдиницыСклад.Видимость = Объект.СкладыВТабличнойЧасти;
	
	ВидимостьУчетныеЕдиницы = (Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.удуВидыОперацийПриходТМЦ.ПокупкаМетодическихМатериалов"));
	
	Элементы.ГруппаТМЦ.Видимость = Не ВидимостьУчетныеЕдиницы;
	Элементы.ГруппаУчетныеЕдиницы.Видимость = ВидимостьУчетныеЕдиницы;
	
КонецПроцедуры


// Управляет параметрами отбора ТЧ "ТМЦ"
//
//
&НаКлиенте
Процедура УстановитьОтборыТЧ_ТМЦ()

    ВидНоменклатуры = ОпределитьДоступныеВидНоменклатуры(Объект.ВидОперации);
	НовыйПараметр = Новый ПараметрВыбора("Отбор.ВидНоменклатуры", ВидНоменклатуры);
	НовыйМассив = Новый Массив();
	НовыйМассив.Добавить(НовыйПараметр);
	НовыеПараметры = Новый ФиксированныйМассив(НовыйМассив);
	Элементы.ТМЦНоменклатура.ПараметрыВыбора = НовыеПараметры;
	
КонецПроцедуры

	
// Рассчитывает сумму НДС от суммы в зависимости от включения НДС в цену
//
// ЦенаВключаетНДС - Булево - Признак включения НДС в цену
// ПроцентНДС      - Число - Ставка НДС числом
// Сумма           - Число - Сумма, от которой необходимо рассчитать сумму НДС
//
&НаКлиенте
Функция РассчитатьСуммуНДС(Сумма, ПроцентНДС) Экспорт
	
	Если Объект.ЦенаВключаетНДС Тогда
		СуммаНДС = Сумма * ПроцентНДС / (ПроцентНДС + 1);
	Иначе
		СуммаНДС = Сумма * ПроцентНДС;
	КонецЕсли;
	
	Возврат СуммаНДС;
	
КонецФункции // РассчитатьСуммуНДС()

&НаКлиенте
Процедура ПересчитатьЦенуСтрокиТЧ(СтрокаТЧ)
	
	  СтрокаТЧ.Цена = ?(СтрокаТЧ.Количество = 0, 0, СтрокаТЧ.Сумма / СтрокаТЧ.Количество);
	
КонецПроцедуры


&НаКлиенте
Процедура ПересчитатьСуммуСтрокиТЧ(СтрокаТЧ)
	
	  СтрокаТЧ.Сумма = СтрокаТЧ.Цена * СтрокаТЧ.Количество;
	
КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьСуммуНДССтрокиТЧ(СтрокаТЧ)
	
	  ПроцентНДС = удуОбработкаТабличнойЧастиТМЦПовтИсп.ПолучитьСтавкуНДСЧислом(СтрокаТЧ.СтавкаНДС);
	  СтрокаТЧ.СуммаНДС = РассчитатьСуммуНДС(СтрокаТЧ.Сумма, ПроцентНДС); 
	
 КонецПроцедуры
  
&НаКлиенте
Процедура ПересчитатьСуммыНДСВТЧ(ИмяТЧ = "ТМЦ")
	
	Таб = Неопределено;
	Объект.Свойство(ИмяТЧ, Таб);
	
	Для каждого СтрокаТЧ из Таб Цикл
		ПересчитатьСуммуНДССтрокиТЧ(СтрокаТЧ);
		ЗаполнитьСуммуВсегоВСтрокеТЧ(СтрокаТЧ);	
	КонецЦикла;
	
КонецПроцедуры
  

&НаКлиенте
Процедура ЗаполнитьСуммуВсегоВСтрокеТЧ(СтрокаТЧ)
	 
	Если Объект.ЦенаВключаетНДС Тогда
		СтрокаТЧ.СуммаВсего = СтрокаТЧ.Сумма;
	Иначе
		СтрокаТЧ.СуммаВсего = СтрокаТЧ.Сумма + СтрокаТЧ.СуммаНДС;
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьСуммыВсегоВТЧ(ИмяТЧ = "ТМЦ")
	
	Таб = Неопределено;
	Объект.Свойство(ИмяТЧ, Таб);
	
	Для каждого СтрокаТЧ из Таб Цикл	
		ЗаполнитьСуммуВсегоВСтрокеТЧ(СтрокаТЧ)	
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСуммуПодвала()
	
	Сумма = Объект.ТМЦ.Итог("Сумма") + Объект.УчетныеЕдиницы.Итог("Сумма");

	Если Не Объект.ЦенаВключаетНДС Тогда
		Сумма = Сумма + Объект.ТМЦ.Итог("СуммаНДС") + Объект.УчетныеЕдиницы.Итог("СуммаНДС");
	КонецЕсли;

	Объект.СуммаДокумента = Сумма;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УправлениеВидимостью();
	
	УстановитьОтборыТЧ_ТМЦ();
	
	ЗаполнитьСуммыВсегоВТЧ("ТМЦ");
	ЗаполнитьСуммыВсегоВТЧ("УчетныеЕдиницы");
	
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ПОЛЕЙ ФОРМЫ

&НаКлиенте
Процедура СкладыВТабличнойЧастиПриИзменении(Элемент)
	
	УправлениеВидимостью();
	
КонецПроцедуры


&НаКлиенте
Процедура ТМЦКоличествоПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.ТМЦ.ТекущиеДанные;
			
	ПересчитатьСуммуСтрокиТЧ(ТекущаяСтрока); 	
	ПересчитатьСуммуНДССтрокиТЧ(ТекущаяСтрока);
	ЗаполнитьСуммуВсегоВСтрокеТЧ(ТекущаяСтрока);
	
	ОбновитьСуммуПодвала();

КонецПроцедуры

&НаКлиенте
Процедура ТМЦЦенаПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.ТМЦ.ТекущиеДанные;
			
	ПересчитатьСуммуСтрокиТЧ(ТекущаяСтрока); 	
	ПересчитатьСуммуНДССтрокиТЧ(ТекущаяСтрока);
	ЗаполнитьСуммуВсегоВСтрокеТЧ(ТекущаяСтрока);
	
	ОбновитьСуммуПодвала();
	
КонецПроцедуры

&НаКлиенте
Процедура ТМЦСуммаПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.ТМЦ.ТекущиеДанные;
	
	ПересчитатьЦенуСтрокиТЧ(ТекущаяСтрока);
	ПересчитатьСуммуНДССтрокиТЧ(ТекущаяСтрока);
	ЗаполнитьСуммуВсегоВСтрокеТЧ(ТекущаяСтрока);
	
	ОбновитьСуммуПодвала();
	
КонецПроцедуры

&НаКлиенте
Процедура ТМЦСтавкаНДСПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.ТМЦ.ТекущиеДанные;
	
	ПересчитатьСуммуНДССтрокиТЧ(ТекущаяСтрока);
	ЗаполнитьСуммуВсегоВСтрокеТЧ(ТекущаяСтрока);
	
	ОбновитьСуммуПодвала();	
	
КонецПроцедуры


&НаКлиенте
Процедура УчетныеЕдиницыКоличествоПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.УчетныеЕдиницы.ТекущиеДанные;
			
	ПересчитатьСуммуСтрокиТЧ(ТекущаяСтрока); 	
	ПересчитатьСуммуНДССтрокиТЧ(ТекущаяСтрока);
	ЗаполнитьСуммуВсегоВСтрокеТЧ(ТекущаяСтрока);
	
	ОбновитьСуммуПодвала();	
	
КонецПроцедуры

&НаКлиенте
Процедура УчетныеЕдиницыЦенаПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.УчетныеЕдиницы.ТекущиеДанные;
			
	ПересчитатьСуммуСтрокиТЧ(ТекущаяСтрока); 	
	ПересчитатьСуммуНДССтрокиТЧ(ТекущаяСтрока);
	ЗаполнитьСуммуВсегоВСтрокеТЧ(ТекущаяСтрока);
	
	ОбновитьСуммуПодвала();	
	
КонецПроцедуры

&НаКлиенте
Процедура УчетныеЕдиницыСуммаПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.УчетныеЕдиницы.ТекущиеДанные;
	
	ПересчитатьЦенуСтрокиТЧ(ТекущаяСтрока);
	ПересчитатьСуммуНДССтрокиТЧ(ТекущаяСтрока);
	ЗаполнитьСуммуВсегоВСтрокеТЧ(ТекущаяСтрока);
	
	ОбновитьСуммуПодвала();
	
	
КонецПроцедуры

&НаКлиенте
Процедура УчетныеЕдиницыСтавкаНДСПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.УчетныеЕдиницы.ТекущиеДанные;
	
	ПересчитатьСуммуНДССтрокиТЧ(ТекущаяСтрока);
	ЗаполнитьСуммуВсегоВСтрокеТЧ(ТекущаяСтрока);
	
	ОбновитьСуммуПодвала();
	
КонецПроцедуры

&НаКлиенте
Процедура СуммаВключаетНДСПриИзменении(Элемент)
	
	ПересчитатьСуммыНДСВТЧ("ТМЦ");
	ПересчитатьСуммыНДСВТЧ("УчетныеЕдиницы");
	ОбновитьСуммуПодвала();
	
КонецПроцедуры

&НаКлиенте
Процедура ВидОперацииПриИзменении(Элемент)
	
	УправлениеВидимостью();
	
	УстановитьОтборыТЧ_ТМЦ(); 

	
КонецПроцедуры

&НаКлиенте
Процедура ВидОперацииОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	УчЕд = (ВыбранноеЗначение = ПредопределенноеЗначение("Перечисление.удуВидыОперацийПриходТМЦ.ПокупкаМетодическихМатериалов"));
	ЕстьУчЕд = объект.УчетныеЕдиницы.Количество() > 0;
	
	НужноОчищатьТЧ_ТМЦ = ОпределитьНеобходимостьОчисткиТЧ_ТМЦ(ВыбранноеЗначение);	
	
	Если НужноОчищатьТЧ_ТМЦ Тогда
		
		Ответ = Вопрос("Данные по ТМЦ будут очищены! Продолжить?",РежимДиалогаВопрос.ДаНет);
		Если Ответ = КодВозвратаДиалога.Нет Тогда
			СтандартнаяОбработка = Ложь;
			Возврат;
		Иначе 
			Объект.ТМЦ.Очистить();
		КонецЕсли;
				
	ИначеЕсли ((Не УчЕд) и ЕстьУчЕд) Тогда  	
		
		Ответ = Вопрос("Данные по Учетным единицам будут очищены! Продолжить?",РежимДиалогаВопрос.ДаНет);
		Если Ответ = КодВозвратаДиалога.Нет Тогда  
			СтандартнаяОбработка = Ложь;
			Возврат;
		Иначе 
			Объект.УчетныеЕдиницы.Очистить();
		КонецЕсли;
		
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ТМЦНоменклатураПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.ТМЦ.ТекущиеДанные;	
	
	Если Не ЗначениеЗаполнено(ТекущаяСтрока.СтавкаНДС) Тогда 
		
		ТекущаяСтрока.СтавкаНДС = ПолучитьСтавкуНДС(ТекущаяСтрока.Номенклатура);
		ПересчитатьСуммуНДССтрокиТЧ(ТекущаяСтрока);
		ЗаполнитьСуммуВсегоВСтрокеТЧ(ТекущаяСтрока);
		ОбновитьСуммуПодвала();
		
	КонецЕсли;

	
КонецПроцедуры

&НаКлиенте
Процедура УчетныеЕдиницыУчетнаяЕдиницаПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.УчетныеЕдиницы.ТекущиеДанные;	
	
	Если Не ЗначениеЗаполнено(ТекущаяСтрока.СтавкаНДС) Тогда 
		
		ТекущаяСтрока.СтавкаНДС = ПолучитьСтавкуНДС(ТекущаяСтрока.УчетнаяЕдиница);
		ПересчитатьСуммуНДССтрокиТЧ(ТекущаяСтрока);
		ЗаполнитьСуммуВсегоВСтрокеТЧ(ТекущаяСтрока);
		ОбновитьСуммуПодвала();
		
	КонецЕсли;

	
КонецПроцедуры
